"agent_OKButton" = "OK";
"agent_CancelButton" = "Cancel";

"agent_menuQuit" = "Quit";
"agent_menuEnablePlugin" = "Enable Folx Plugin";
"agent_menuConfigure" = "Plugin Preferences";

"agent_menuAddTask" = "New Task";
"agent_menuStartAll" = "Start All";
"agent_menuStopAll" = "Stop All";

"agent_btnUsePlugin" = "Use Folx to catch download links in browsers";
"agent_prefCheckMimeType" = "Catching types:";
"agent_prefRestoreDefaults" = "Restore defaults";

"agent_msgErrorAddCatchingType" = "All fields are required";
"agent_infoErrorAddCatchingType" = "Please fill in all fields to add the file type to catch";

"agent_Description" = "Description";
"agent_MimeType" = "MIME type";
"agent_Extensions" = "Extension(s)";

"agent_msgFolxNotFound" = "Folx is not installed on this computer ";
"agent_infoFolxNotFound" = "Folx plugin cannot operate without the initial Folx app. In order to catch links and download files you need to download and install Folx download manager itself.";

"agent_msgInstallPlugin" = "Folx Agent has finished installing its browser plug-ins";
"agent_infoInstallPlugin" = "Please restart your Internet browsers to activate links catching option. For exact list of supported browsers visit Folx Help.";